erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/СХК_ТаймингТСД/СХК_ТаймингТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СХК_ТаймингТСД</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/Catalogs/СХК_ШтрихкодСотрудника/СХК_ШтрихкодСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_ШтрихкодСотрудника</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/ManagerModule.bsl
Функция ПолучитьПользователяПоШК(ШК) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ШтрихкодСотрудника.Ссылка КАК Ссылка,
	               |	СХК_ШтрихкодСотрудника.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	Справочник.СХК_ШтрихкодСотрудника КАК СХК_ШтрихкодСотрудника
	               |ГДЕ
	               |	СХК_ШтрихкодСотрудника.ШтрихКод = &ШтрихКод
	               |	И СХК_ШтрихкодСотрудника.Блокировка = ЛОЖЬ
	               |	И СХК_ШтрихкодСотрудника.Сотрудник.Недействителен = ЛОЖЬ";
	Запрос.УстановитьПараметр("ШтрихКод",ШК); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда
		Возврат Рез.Сотрудник;
	Иначе
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
						
КонецФункции    

Процедура ИзменитьТайминг(ИмяПользователя) Экспорт
	Сотр = Пользователи.ПользовательПоНаименованию(ИмяПользователя); 
	НаборЗаписей = РегистрыСведений.СХК_ТаймингТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотр);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда 
		НовыйНомер = НаборЗаписей.Добавить();
		НовыйНомер.Пользователь = Сотр;
		НовыйНомер.Период = ТекущаяДата(); 
	Иначе
		НовыйНомер = НаборЗаписей[0];
		НовыйНомер.Период = ТекущаяДата();
	КонецЕсли;
	НаборЗаписей.Записать(Истина); 

КонецПроцедуры   

Функция ПроверитьТайминг(Сотрудник) Экспорт 
	НаборЗаписей = РегистрыСведений.СХК_ТаймингТСД.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Сотрудник);
	НаборЗаписей.Прочитать();

	Тайминг = НаборЗаписей[0];
	Если ТекущаяДата() - Тайминг.Период > 900 Тогда
		Возврат Ложь;	
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
